# 6.1 Reading and Writing Data in Text Format

In [4]:
import numpy as np
import pandas as pd
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [5]:
!cat pydata-book-2nd-edition/examples/ex1.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [7]:
df = pd.read_csv('pydata-book-2nd-edition/examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
pd.read_table('pydata-book-2nd-edition/examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
!cat pydata-book-2nd-edition/examples/ex2.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [14]:
pd.read_csv('pydata-book-2nd-edition/examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [15]:
pd.read_csv('pydata-book-2nd-edition/examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
names = ['a', 'b', 'c', 'd', 'message']

In [17]:
pd.read_csv('pydata-book-2nd-edition/examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [19]:
!cat pydata-book-2nd-edition/examples/csv_mindex.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [20]:
parsed = pd.read_csv('pydata-book-2nd-edition/examples/csv_mindex.csv',
                     index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [22]:
list(open('pydata-book-2nd-edition/examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [24]:
result = pd.read_table('pydata-book-2nd-edition/examples/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [25]:
!cat pydata-book-2nd-edition/examples/ex4.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [27]:
pd.read_csv('pydata-book-2nd-edition/examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [29]:
!cat examples/ex5.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [30]:
result = pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [31]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [33]:
result = pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [34]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [36]:
pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

## Reading Text Files in Pieces

In [37]:
pd.options.display.max_rows = 10

In [39]:
result = pd.read_csv('pydata-book-2nd-edition/examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [40]:
pd.read_csv('pydata-book-2nd-edition/examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [42]:
chunker = pd.read_csv('pydata-book-2nd-edition/examples/ex6.csv', chunksize=1000)
chunker

In [43]:
chunker = pd.read_csv('pydata-book-2nd-edition/examples/ex6.csv', chunksize=1000)
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

In [44]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

## Writing Data to Text Format

In [46]:
data = pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [47]:
data.to_csv('pydata-book-2nd-edition/examples/out.csv')

In [48]:
!cat pydata-book-2nd-edition/examples/out.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [49]:
import sys

In [50]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [51]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [52]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [53]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [54]:
dates = pd.date_range('1/1/2000', periods=7)

In [55]:
ts = pd.Series(np.arange(7), index=dates)

In [56]:
ts.to_csv('pydata-book-2nd-edition/examples/tseries.csv')

In [57]:
!cat examples/tseries.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

## Working with Delimited Formats

In [59]:
!cat pydata-book-2nd-edition/examples/ex7.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [79]:
import csv
f = open('pydata-book-2nd-edition/examples/ex7.csv')
reader = csv.reader(f)

In [80]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [65]:
with open('pydata-book-2nd-edition/examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [66]:
header, values = lines[0], lines[1:]

In [67]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [68]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [70]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [77]:
f = open('pydata-book-2nd-edition/examples/ex7.csv')
reader = csv.reader(f, dialect=my_dialect)
for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [78]:
f = open('pydata-book-2nd-edition/examples/ex7.csv')
reader = csv.reader(f, delimiter='|')
for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [81]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

## JSON Data

In [84]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [85]:
import json

In [87]:
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [89]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [90]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [91]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [93]:
!cat pydata-book-2nd-edition/examples/example.json

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [95]:
data = pd.read_json('pydata-book-2nd-edition/examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [96]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [97]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## XML and HTML: Web Scraping

In [99]:
tables = pd.read_html('pydata-book-2nd-edition/examples/fdic_failed_bank_list.html')
len(tables)

1

In [100]:
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [101]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

## Parsing XML with lxml.objectify

In [103]:
from lxml import objectify

In [105]:
path = 'pydata-book-2nd-edition/datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [106]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [107]:
perf = pd.DataFrame(data)

In [108]:
perf.head()

,AGENCY_NAME,CATEGORY,DESCRIPTION,FREQUENCY,INDICATOR_NAME,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95,95,2,2008,96,95
2,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,98.3,95,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95.8,95,5,2008,96.6,95

In [109]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [110]:
root

In [111]:
root.get('href')

'http://www.google.com'

In [112]:
root.text

'Google'

# Question 1

In [113]:
tables = pd.read_html('examples/Food Composition Databases Show Foods List.html')
len(tables)

1

In [114]:
USDA = tables[0]
USDA.head()

,DB,NDB Id,Food Description,Food Group or Manufacturer
0,BF,45059050,"A.A. BORSARI, PEPPER SEASONING PEPPERCORN, UPC...",Valley Brook Farm
1,BF,45058983,"A.A. BORSARI, SAVORY SEASONED SALT, UPC: 81589...",Valley Brook Farm
2,BF,45078606,"AARDVARK HABENERO HOT SAUCE, UPC: 853393000030",Secret Aardvark Trading Company
3,BF,45169417,"A&B AMERICAN STYLE, MORE HEAT SMALL BATCH PEPP...",A & B AMERICAN STYLE LLC
4,BF,45169419,"A&B AMERICAN STYLE, ORGANIC PEPPER SAUCE, UPC:...",A & B AMERICAN STYLE LLC

In [115]:
USDA

,DB,NDB Id,Food Description,Food Group or Manufacturer
0,BF,45059050,"A.A. BORSARI, PEPPER SEASONING PEPPERCORN, UPC...",Valley Brook Farm
1,BF,45058983,"A.A. BORSARI, SAVORY SEASONED SALT, UPC: 81589...",Valley Brook Farm
2,BF,45078606,"AARDVARK HABENERO HOT SAUCE, UPC: 853393000030",Secret Aardvark Trading Company
3,BF,45169417,"A&B AMERICAN STYLE, MORE HEAT SMALL BATCH PEPP...",A & B AMERICAN STYLE LLC
4,BF,45169419,"A&B AMERICAN STYLE, ORGANIC PEPPER SAUCE, UPC:...",A & B AMERICAN STYLE LLC
...,...,...,...,...
20,BF,45091765,"ABC, JELLY SNACK, TARO, UPC: 4711269687135",none
21,BF,45166992,"ABC, PEANUT BUTTER, UPC: 837991219186",none
22,BF,45153753,"ABDALLAH, ALMOND COCONUT CARAMELS, UPC: 766684...","Abdallah, Inc."
23,BF,45145908,"ABDALLAH, ENGLISH TOFFEE, UPC: 766684006027","Abdallah, Inc."
24,BF,45161152,"ABDALLAH, MY SWEET REWARD CARAMEL PATTIES, UPC...","Abdallah, Inc."

In [116]:
Manufacturer_stamps = USDA['Food Group or Manufacturer']
Manufacturer_stamps.value_counts()

none                               4
A & B AMERICAN STYLE LLC           3
Ross Products Division             3
Abdallah, Inc.                     3
Valley Brook Farm                  2
                                  ..
A.M. Baking Company, Inc.          2
Namaste Foods                      1
Bewley Irish Imports               1
August Bauer's Sons Inc.           1
Secret Aardvark Trading Company    1
Name: Food Group or Manufacturer, Length: 12, dtype: int64